Revit 2015 API
MaterialSet.Erase Method
Removes a specified material from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual int Erase(
	Material item
)
Visual Basic
Public Overridable Function Erase ( _
	item As Material _
) As Integer
Visual C++
public:
virtual int Erase(
	Material^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Material
The material to be erased.
Return Value
The number of materials that were erased from the set.
See Also
MaterialSet Class
Autodesk.Revit.DB Namespace